#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
random_id.db_suffix: Refreshing state... [id=1ktCfQ]
google_project_service.secretmanager: Refreshing state... [id=fullstack-app-base/secretmanager.googleapis.com]
google_compute_network.vpc: Refreshing state... [id=projects/fullstack-app-base/global/networks/fullstack-app-vpc]
google_project_iam_member.github_actions_cloud_sql_admin: Refreshing state... [id=fullstack-app-base/roles/cloudsql.admin/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.github_actions_artifact_registry_admin: Refreshing state... [id=fullstack-app-base/roles/artifactregistry.admin/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.github_actions_service_account_admin: Refreshing state... [id=fullstack-app-base/roles/iam.serviceAccountAdmin/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.github_actions_workload_identity_pool_admin: Refreshing state... [id=fullstack-app-base/roles/iam.workloadIdentityPoolAdmin/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.github_actions_storage_admin: Refreshing state... [id=fullstack-app-base/roles/storage.admin/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.github_actions_cloud_run_admin: Refreshing state... [id=fullstack-app-base/roles/run.admin/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.github_actions_compute_network_viewer: Refreshing state... [id=fullstack-app-base/roles/compute.networkViewer/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_service.vpcaccess: Refreshing state... [id=fullstack-app-base/vpcaccess.googleapis.com]
google_project_service.iam: Refreshing state... [id=fullstack-app-base/iam.googleapis.com]
google_service_account.cloud_run: Refreshing state... [id=projects/fullstack-app-base/serviceAccounts/fullstack-app-cloud-run-sa@fullstack-app-base.iam.gserviceaccount.com]
google_project_service.compute: Refreshing state... [id=fullstack-app-base/compute.googleapis.com]
google_project_service.servicenetworking: Refreshing state... [id=fullstack-app-base/servicenetworking.googleapis.com]
google_project_service.run: Refreshing state... [id=fullstack-app-base/run.googleapis.com]
google_project_service.artifactregistry: Refreshing state... [id=fullstack-app-base/artifactregistry.googleapis.com]
google_project_service.sqladmin: Refreshing state... [id=fullstack-app-base/sqladmin.googleapis.com]
google_project_service.sts: Refreshing state... [id=fullstack-app-base/sts.googleapis.com]
google_project_service.iamcredentials: Refreshing state... [id=fullstack-app-base/iamcredentials.googleapis.com]
google_compute_global_address.private_ip_address: Refreshing state... [id=projects/fullstack-app-base/global/addresses/fullstack-app-private-ip]
google_project_iam_member.cloud_sql_instance_user: Refreshing state... [id=fullstack-app-base/roles/cloudsql.instanceUser/serviceAccount:fullstack-app-cloud-run-sa@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.cloud_sql_client: Refreshing state... [id=fullstack-app-base/roles/cloudsql.client/serviceAccount:fullstack-app-cloud-run-sa@fullstack-app-base.iam.gserviceaccount.com]
google_artifact_registry_repository.backend: Refreshing state... [id=projects/fullstack-app-base/locations/asia-northeast1/repositories/backend]
google_vpc_access_connector.connector: Refreshing state... [id=projects/fullstack-app-base/locations/asia-northeast1/connectors/fullstack-app-vpc-conn]
google_secret_manager_secret.flask_secret_key: Refreshing state... [id=projects/fullstack-app-base/secrets/fullstack-app-flask-secret-key]
google_iam_workload_identity_pool.github_actions: Refreshing state... [id=projects/fullstack-app-base/locations/global/workloadIdentityPools/fullstack-app-github-pool]
google_service_account.github_actions: Refreshing state... [id=projects/fullstack-app-base/serviceAccounts/fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_secret_manager_secret.jwt_secret_key: Refreshing state... [id=projects/fullstack-app-base/secrets/fullstack-app-jwt-secret-key]
google_iam_workload_identity_pool_provider.github_actions: Refreshing state... [id=projects/fullstack-app-base/locations/global/workloadIdentityPools/fullstack-app-github-pool/providers/fullstack-app-github-provider]
google_secret_manager_secret_version.flask_secret_key: Refreshing state... [id=projects/853642690014/secrets/fullstack-app-flask-secret-key/versions/1]
google_secret_manager_secret_iam_member.flask_secret_access: Refreshing state... [id=projects/fullstack-app-base/secrets/fullstack-app-flask-secret-key/roles/secretmanager.secretAccessor/serviceAccount:fullstack-app-cloud-run-sa@fullstack-app-base.iam.gserviceaccount.com]
google_secret_manager_secret_version.jwt_secret_key: Refreshing state... [id=projects/853642690014/secrets/fullstack-app-jwt-secret-key/versions/1]
google_secret_manager_secret_iam_member.jwt_secret_access: Refreshing state... [id=projects/fullstack-app-base/secrets/fullstack-app-jwt-secret-key/roles/secretmanager.secretAccessor/serviceAccount:fullstack-app-cloud-run-sa@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.github_actions_secret_manager_admin: Refreshing state... [id=fullstack-app-base/roles/secretmanager.admin/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_service_account_iam_member.github_actions_workload_identity: Refreshing state... [id=projects/fullstack-app-base/serviceAccounts/fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/853642690014/locations/global/workloadIdentityPools/fullstack-app-github-pool/attribute.repository/TomokiIshimine/fullstack-app-with-claude]
google_project_iam_member.github_actions_sa_user: Refreshing state... [id=fullstack-app-base/roles/iam.serviceAccountUser/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.github_actions_service_usage_admin: Refreshing state... [id=fullstack-app-base/roles/serviceusage.serviceUsageAdmin/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_service_networking_connection.private_vpc_connection: Refreshing state... [id=projects%2Ffullstack-app-base%2Fglobal%2Fnetworks%2Ffullstack-app-vpc:servicenetworking.googleapis.com]
google_sql_database_instance.main: Refreshing state... [id=fullstack-app-db-d64b427d]
google_sql_user.user: Refreshing state... [id=app_user//fullstack-app-db-d64b427d]
google_sql_database.database: Refreshing state... [id=projects/fullstack-app-base/instances/fullstack-app-db-d64b427d/databases/app_db]
google_sql_user.iam_user: Refreshing state... [id=fullstack-app-cloud-run-sa/%/fullstack-app-db-d64b427d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # google_project_iam_member.github_actions_artifact_registry_repo_admin will be created
  + resource "google_project_iam_member" "github_actions_artifact_registry_repo_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com"
      + project = "fullstack-app-base"
      + role    = "roles/artifactregistry.repoAdmin"
    }

  # google_project_iam_member.github_actions_artifact_registry_writer will be created
  + resource "google_project_iam_member" "github_actions_artifact_registry_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com"
      + project = "fullstack-app-base"
      + role    = "roles/artifactregistry.writer"
    }

  # google_project_iam_member.github_actions_cloud_run_developer will be created
  + resource "google_project_iam_member" "github_actions_cloud_run_developer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com"
      + project = "fullstack-app-base"
      + role    = "roles/run.developer"
    }

  # google_project_iam_member.github_actions_cloud_sql_editor will be created
  + resource "google_project_iam_member" "github_actions_cloud_sql_editor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com"
      + project = "fullstack-app-base"
      + role    = "roles/cloudsql.editor"
    }

  # google_project_iam_member.github_actions_compute_network_admin will be created
  + resource "google_project_iam_member" "github_actions_compute_network_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com"
      + project = "fullstack-app-base"
      + role    = "roles/compute.networkAdmin"
    }

  # google_project_iam_member.github_actions_iam_role_viewer will be created
  + resource "google_project_iam_member" "github_actions_iam_role_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com"
      + project = "fullstack-app-base"
      + role    = "roles/iam.roleViewer"
    }

  # google_project_iam_member.github_actions_security_admin will be created
  + resource "google_project_iam_member" "github_actions_security_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com"
      + project = "fullstack-app-base"
      + role    = "roles/iam.securityAdmin"
    }

  # google_project_iam_member.github_actions_service_account_creator will be created
  + resource "google_project_iam_member" "github_actions_service_account_creator" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com"
      + project = "fullstack-app-base"
      + role    = "roles/iam.serviceAccountCreator"
    }

  # google_project_iam_member.github_actions_service_account_key_admin will be created
  + resource "google_project_iam_member" "github_actions_service_account_key_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com"
      + project = "fullstack-app-base"
      + role    = "roles/iam.serviceAccountKeyAdmin"
    }

  # google_project_iam_member.github_actions_servicenetworking_admin will be created
  + resource "google_project_iam_member" "github_actions_servicenetworking_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com"
      + project = "fullstack-app-base"
      + role    = "roles/servicenetworking.networksAdmin"
    }

  # google_project_iam_member.github_actions_storage_legacy_bucket_writer will be created
  + resource "google_project_iam_member" "github_actions_storage_legacy_bucket_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com"
      + project = "fullstack-app-base"
      + role    = "roles/storage.legacyBucketWriter"
    }

  # google_project_iam_member.github_actions_storage_object_admin will be created
  + resource "google_project_iam_member" "github_actions_storage_object_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com"
      + project = "fullstack-app-base"
      + role    = "roles/storage.objectAdmin"
    }

  # google_project_iam_member.github_actions_vpcaccess_admin will be created
  + resource "google_project_iam_member" "github_actions_vpcaccess_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com"
      + project = "fullstack-app-base"
      + role    = "roles/vpcaccess.admin"
    }

  # google_project_service.redis will be created
  + resource "google_project_service" "redis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "fullstack-app-base"
      + service            = "redis.googleapis.com"
    }

  # google_redis_instance.rate_limiter will be created
  + resource "google_redis_instance" "rate_limiter" {
      + alternative_location_id     = (known after apply)
      + auth_enabled                = true
      + auth_string                 = (sensitive value)
      + authorized_network          = "projects/fullstack-app-base/global/networks/fullstack-app-vpc"
      + connect_mode                = "DIRECT_PEERING"
      + create_time                 = (known after apply)
      + current_location_id         = (known after apply)
      + display_name                = "Rate Limiter Redis"
      + effective_labels            = {
          + "app"                        = "fullstack-app"
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
          + "purpose"                    = "rate-limiting"
        }
      + effective_reserved_ip_range = (known after apply)
      + host                        = (known after apply)
      + id                          = (known after apply)
      + labels                      = {
          + "app"         = "fullstack-app"
          + "environment" = "production"
          + "managed_by"  = "terraform"
          + "purpose"     = "rate-limiting"
        }
      + location_id                 = (known after apply)
      + maintenance_schedule        = (known after apply)
      + maintenance_version         = (known after apply)
      + memory_size_gb              = 1
      + name                        = "fullstack-app-rate-limiter"
      + nodes                       = (known after apply)
      + persistence_iam_identity    = (known after apply)
      + port                        = (known after apply)
      + project                     = "fullstack-app-base"
      + read_endpoint               = (known after apply)
      + read_endpoint_port          = (known after apply)
      + read_replicas_mode          = (known after apply)
      + redis_version               = "REDIS_7_0"
      + region                      = "asia-northeast1"
      + replica_count               = (known after apply)
      + reserved_ip_range           = (known after apply)
      + secondary_ip_range          = (known after apply)
      + server_ca_certs             = (known after apply)
      + terraform_labels            = {
          + "app"                        = "fullstack-app"
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
          + "purpose"                    = "rate-limiting"
        }
      + tier                        = "BASIC"
      + transit_encryption_mode     = "DISABLED"

      + maintenance_policy {
          + create_time = (known after apply)
          + update_time = (known after apply)

          + weekly_maintenance_window {
              + day      = "SUNDAY"
              + duration = (known after apply)

              + start_time {
                  + hours   = 3
                  + minutes = 0
                  + nanos   = 0
                  + seconds = 0
                }
            }
        }

      + persistence_config (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + redis_auth_string                    = (sensitive value)
  + redis_host                           = (known after apply)
  + redis_port                           = (known after apply)

Error: Error when reading or editing Resource "project \"fullstack-app-base\"" with IAM Member: Role "roles/iam.serviceAccountAdmin" Member "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com": Error retrieving IAM policy for project "fullstack-app-base": googleapi: Error 403: The caller does not have permission, forbidden


Error: Error when reading or editing Resource "project \"fullstack-app-base\"" with IAM Member: Role "roles/artifactregistry.admin" Member "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com": Error retrieving IAM policy for project "fullstack-app-base": googleapi: Error 403: The caller does not have permission, forbidden


Error: Error when reading or editing Resource "project \"fullstack-app-base\"" with IAM Member: Role "roles/cloudsql.admin" Member "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com": Error retrieving IAM policy for project "fullstack-app-base": googleapi: Error 403: The caller does not have permission, forbidden


Error: Error when reading or editing Resource "project \"fullstack-app-base\"" with IAM Member: Role "roles/iam.workloadIdentityPoolAdmin" Member "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com": Error retrieving IAM policy for project "fullstack-app-base": googleapi: Error 403: The caller does not have permission, forbidden


Error: Error when reading or editing Resource "project \"fullstack-app-base\"" with IAM Member: Role "roles/storage.admin" Member "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com": Error retrieving IAM policy for project "fullstack-app-base": googleapi: Error 403: The caller does not have permission, forbidden


Error: Error when reading or editing Resource "project \"fullstack-app-base\"" with IAM Member: Role "roles/run.admin" Member "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com": Error retrieving IAM policy for project "fullstack-app-base": googleapi: Error 403: The caller does not have permission, forbidden


Error: Error when reading or editing Resource "project \"fullstack-app-base\"" with IAM Member: Role "roles/compute.networkViewer" Member "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com": Error retrieving IAM policy for project "fullstack-app-base": googleapi: Error 403: The caller does not have permission, forbidden


Error: Error when reading or editing Resource "project \"fullstack-app-base\"" with IAM Member: Role "roles/cloudsql.client" Member "serviceAccount:fullstack-app-cloud-run-sa@fullstack-app-base.iam.gserviceaccount.com": Error retrieving IAM policy for project "fullstack-app-base": googleapi: Error 403: The caller does not have permission, forbidden

  with google_project_iam_member.cloud_sql_client,
  on cloud-sql.tf line 114, in resource "google_project_iam_member" "cloud_sql_client":
 114: resource "google_project_iam_member" "cloud_sql_client" {


Error: Error when reading or editing Resource "project \"fullstack-app-base\"" with IAM Member: Role "roles/cloudsql.instanceUser" Member "serviceAccount:fullstack-app-cloud-run-sa@fullstack-app-base.iam.gserviceaccount.com": Error retrieving IAM policy for project "fullstack-app-base": googleapi: Error 403: The caller does not have permission, forbidden

  with google_project_iam_member.cloud_sql_instance_user,
  on cloud-sql.tf line 121, in resource "google_project_iam_member" "cloud_sql_instance_user":
 121: resource "google_project_iam_member" "cloud_sql_instance_user" {


Error: Error when reading or editing VPCAccessConnector "projects/fullstack-app-base/locations/asia-northeast1/connectors/fullstack-app-vpc-conn": googleapi: Error 403: Permission 'vpcaccess.connectors.get' denied on resource '//vpcaccess.googleapis.com/projects/fullstack-app-base/locations/asia-northeast1/connectors/fullstack-app-vpc-conn' (or it may not exist).
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ErrorInfo",
    "domain": "vpcaccess.googleapis.com",
    "metadata": {
      "permission": "vpcaccess.connectors.get",
      "resource": "projects/fullstack-app-base/locations/asia-northeast1/connectors/fullstack-app-vpc-conn"
    },
    "reason": "IAM_PERMISSION_DENIED"
  }
]

  with google_vpc_access_connector.connector,
  on cloud-sql.tf line 161, in resource "google_vpc_access_connector" "connector":
 161: resource "google_vpc_access_connector" "connector" {


Error: Error when reading or editing Resource "project \"fullstack-app-base\"" with IAM Member: Role "roles/iam.serviceAccountUser" Member "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com": Error retrieving IAM policy for project "fullstack-app-base": googleapi: Error 403: The caller does not have permission, forbidden

  with google_project_iam_member.github_actions_sa_user,
  on iam.tf line 70, in resource "google_project_iam_member" "github_actions_sa_user":
  70: resource "google_project_iam_member" "github_actions_sa_user" {


Error: Error when reading or editing Resource "project \"fullstack-app-base\"" with IAM Member: Role "roles/secretmanager.admin" Member "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com": Error retrieving IAM policy for project "fullstack-app-base": googleapi: Error 403: The caller does not have permission, forbidden

  with google_project_iam_member.github_actions_secret_manager_admin,
  on iam.tf line 173, in resource "google_project_iam_member" "github_actions_secret_manager_admin":
 173: resource "google_project_iam_member" "github_actions_secret_manager_admin" {


Error: Error when reading or editing Resource "project \"fullstack-app-base\"" with IAM Member: Role "roles/serviceusage.serviceUsageAdmin" Member "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com": Error retrieving IAM policy for project "fullstack-app-base": googleapi: Error 403: The caller does not have permission, forbidden

  with google_project_iam_member.github_actions_service_usage_admin,
  on iam.tf line 182, in resource "google_project_iam_member" "github_actions_service_usage_admin":
 182: resource "google_project_iam_member" "github_actions_service_usage_admin" {

::error::Terraform exited with code 1.

```

</details>

*Pusher: @TomokiIshimine, Action: `pull_request`, Workflow: `Terraform`*